-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 18, 2023 at 06:13 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `agroshop`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin_users`
--

CREATE TABLE `admin_users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `admin_users`
--

INSERT INTO `admin_users` (`id`, `username`, `password`) VALUES
(1, 'admin', 'admin');

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `cat_id` int(11) NOT NULL,
  `cat_name` varchar(255) NOT NULL,
  `cat_ban_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`cat_id`, `cat_name`, `cat_ban_name`) VALUES
(1, 'home', 'হোম'),
(2, 'seed', 'বীজ'),
(3, 'fertilizer', 'ফার্টিলাইজার'),
(4, 'equipment', 'কৃষি সরঞ্জাম'),
(5, 'disease', 'রোগ এবং প্রতিকার'),
(6, 'user', 'ইউজার'),
(7, 'cart', 'কার্ট');

-- --------------------------------------------------------

--
-- Table structure for table `disease`
--

CREATE TABLE `disease` (
  `p_id` int(11) NOT NULL,
  `p_image` varchar(255) NOT NULL,
  `titleone` varchar(255) DEFAULT NULL,
  `desone` text DEFAULT NULL,
  `titletwo` varchar(255) DEFAULT NULL,
  `destwo` text DEFAULT NULL,
  `titlethree` varchar(255) DEFAULT NULL,
  `desthree` text DEFAULT NULL,
  `p_cat` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `disease`
--

INSERT INTO `disease` (`p_id`, `p_image`, `titleone`, `desone`, `titletwo`, `destwo`, `titlethree`, `desthree`, `p_cat`) VALUES
(1, 'D2.jpg', 'রোগের নামঃ', 'লাউয়ের গ্রে মোল্ড রোগ', 'লক্ষণঃ', 'এ রোগ দেখা দিলে পাতায় পানি ভেজা দাগ দেখা যায় এবং কান্ডের উপর ছত্রাকের আস্তরণ পড়ে ।\r\nএক সময় কান্ড পঁচে যায় ।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'কপার অক্সিক্লোরাইট জাতীয় ছত্রাক নাশক যেমন- কুপ্রাভিট ৭ গ্রাম / লিটার হারে পানিতে মিশিয়ে স্প্রে করা ।\r\nআগাম বীজ বপন করা।\r\nসুষম সার ব্যবহার করা।', 5),
(2, 'D3.jpg', 'রোগের নামঃ', 'লাউয়ের স্ক্যাব রোগ', 'লক্ষণঃ', 'পাতা, কান্ড ও লাউয়ের গায়ে ক্ষত দেখা যায় । গাছের পাতা শুকিয়ে যায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'ক্ষেতে পানি নিস্কাষনের সুব্যবস্থা করা ।\r\nরিডোমিল গোল্ড ২ গ্রাম/প্রতি লিটার পানি মিশিয়ে স্প্রে করা ।\r\nএকই জমিতে বার বার লাউ আবাদ না করা।\r\nআক্রান্ত গাছ থেকে বীজ সংগ্রহ করবেন না।', 5),
(3, 'D4.jpg', 'রোগের নামঃ', 'লাউয়ের ব্লোজম এন্ড রট রোগ', 'লক্ষণঃ', 'আক্রান্ত গাছে প্রথমে কচি লাউয়ের নিচের দিকে পঁচন দেখা দেয়।\r\nধীরে ধীরে পুরো ফলটিই পঁচে যায় ।\r\nসাধারণত আম্লীয় মাটিতে বা ক্যালসিয়ামের অভাব আছে এমন জমিতে এ রোগ দেখা যায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'ক্ষেতে পরিমিত সেচ দেয়া ।\r\nগর্ত বা পিট প্রতি ৫০ থেকে ৮০ গ্রাম জিপসাম সার প্রয়োগ করা ।\r\nএকই জমিতে বার বার একই সবজি আবাদ করবেন না।\r\nজমিতে শতাংশ প্রতি চার কেজি হারে ডলোচুন প্রয়োগ করলে পরপর আর তিন বছর প্রয়োগ করতে হবেনা।\r\nঅম্লীয় বা লাল মাটির ক্ষেত্রে জমিতে শতাংশ প্রতি চার কেজি হারে ডলোচুন প্রয়োগ করা।\r\nমাটি পরীক্ষা করে জমিতে সুষম সার ব্যবহার করা।', 5),
(4, 'D5.jpg', 'রোগের নামঃ', 'চালকুমড়ার লিফ কার্ল রোগ', 'লক্ষণঃ', 'এটি একটি ভাইরাস জনিত রোগ।\r\nসাদা মাছি দ্বারা ভাইরাস ছড়ায় ।\r\nআক্রান্ত গাছ খর্বাকৃতি হয় ।\r\nপাতার গায়ে টেউয়ের মত ভাজের সৃষ্টি হয়, কুঁচকে যায় ।\r\nবয়স্ক পাতা পুরু ও মচমচে হয়ে যায় । অতিরিক্ত শাখা প্রশাখা বের হয় ও ফুল ফল ধারণ ক্ষমতা হারিয়ে ফেলে ।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'আক্রান্ত গাছ সংগ্রহ করে ধ্বংস করা ।\r\nরোগমুক্ত গাছ থেকে বীজ সংগ্রহ করা ।\r\nরোগ প্রতিরোধ ক্ষমতা সম্পন্ন জাত ব্যবহার করা ।\r\nভাইরাসের বাহক পোকা দমনেহার জন্য ডায়ামেথেয়ট, এসাটাফ, এডমেয়ার, টিডো, ইত্যাদি যে কোন একটি ১ মিলি /লিটার হারে পানিতে মিশিয়ে স্প্রে করা) ।', 5),
(5, 'D6.jpg', 'রোগের নামঃ', 'চালকুমড়ার গামি স্টেম ব্লাইট রোগ', 'লক্ষণঃ', 'এ রোগ হলে পাতায় পানি ভেজা দাগ দেখা যায়।\r\nব্যপক আক্রমনে পাতা শুকিয়ে যায় এবং গাছ মারা যায়।\r\nকান্ড ফেটে লালচে আঠা বের হয়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'ক্ষেত থেকে আক্রান্ত গাছ তুলে ফেলা\r\nরোগমুক্ত বীজ বা চারা ব্যবহার করা\r\nম্যানকোজেব অথবা ম্যানকোজেব + মেটালক্সিল যেমন: রিদোমিল গোল্ড ২ গ্রাম / লি. হারে পানিতে মিশিয়ে ৭-১০ দিন পরপর ৩ বার স্প্রে করা।\r\nআক্রান্ত গাছ থেকে বীজ সংগ্রহ করবেন না।\r\nআগাম বীজ বপন করা।\r\nসুষম সার ব্যবহার করা।\r\nরোগ প্রতিরোধী জাত যেমন: বারি জাতের চাষ করা\r\nবিকল্প পোষক যেমন: আগাছা পরিষ্কার রাখা।', 5),
(6, 'D7.jpg', 'রোগের নামঃ', 'টমেটোর ফল ফেটে যাওয়া সমস্যা', 'লক্ষণঃ', 'তাপমাত্রার দ্রত পরিবর্তন, অতি পানি ঘাটতির পর হঠাৎ সেচ দেওয়া বা গাছের শরীরবৃত্তীয় কারণে কখনও কখনও টমেটো ফেটে যায়।\r\nএতে টমেটো খাবারের অযোগ্য হয়ে পড়ে।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'জমিতে নিয়মিত সেচ দেওয়া।\r\nসুষম সার ব্যবহার করা।\r\nসঠিক দুরত্বে চারা রোপন করা।\r\nখরার সময় হঠাৎ জমিতে সেচ প্রয়োগ করবেন না।\r\nআগাম বীজ বপন করা।\r\nনিয়মিত জমির আদ্রতা পরীক্ষা করে সেচ দিন।', 5),
(7, 'D8.jpg', 'রোগের নামঃ', 'টমেটোর বাক আই রোগ', 'লক্ষণঃ', 'মাটির কাছাকাছি থাকা ফলের নিচের দিকে প্রথমে পঁচা শুরু হয় এবং ক্রমশ তা উপরের দিকে ছড়িয়ে পড়ে।\r\nআক্রান্ত স্থান মসৃণ হয় এবং গাঢ় বাদমি ও হালকা বাদামি রঙ্গের ব্যান্ড দেখা যায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'রোগমুক্ত এলাকা হতে সুস্থ বীজ সংগ্রহ করা ।\r\nসুস্থ, সবল ও রোগ সহনশীল জাত চাষ করা ।\r\nপরিমিত সার ব্যবহার ও সেচ প্রয়োগ করা ।\r\nশস্য পর্যায়ক্রম অনুসরণ করা ।\r\nরোগের অনুকুল পূর্বাভাস পাওয়া মাত্র প্রতিরোধক হিসাবে ২ গ্রাম ম্যানকোজেব + মেটালেক্সিল (রিডোমিল গোল্ড, করমি, মেটারিল) জাতীয় ছত্রাকনাশক প্রতি লিটার পানিতে মিশিয়ে স্প্রে করা রোগের আক্রমণ বেশী হলে প্রতি লিটার পানিতে-২ গ্রাম সিকিউর মিশিয়ে স্প্রে করলে ভাল ফল পাওয়া যায় ।', 5),
(8, 'D9.jpg', 'রোগের নামঃ', 'টমেটোর পাতা কোকড়ানো বা লিফ কার্ল রোগ', 'লক্ষণঃ', 'সাদা মাছি দ্বারা ভাইরাস ছড়ায়।\r\nআক্রান্ত গাছ খর্বাকৃতি হয়।\r\nপাতার গায়ে ঢেউয়ের মত ভাজের সৃষ্টি হয় ও পাতা ভীষণ ভাবে কোঁকড়ায়ে যায়।\r\nবয়স্ক পাতা পুরু মচমচে হয়ে যায়।\r\nআক্রমণ বেশী হলে পাতা মরে যায়।\r\nগাছে অতিরিক্ত শাখা প্রশাখা বের হয় এবং ফুল ও ফল ধারণ ক্ষমতা হারিয়ে ফেলে।\r\nপাতার কিনারা থেকে মধ্যশিরার দিকে গুটিয়ে যায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'আক্রান্ত গাছ দেখা মাত্র তুলে ধ্বংস করা।\r\nরোগমুক্ত গাছ থেকে বীজ সংগ্রহ করা।\r\nরোগ প্রতিরোধ ক্ষমতা সম্পন্ন জাত ব্যবহার করা।\r\nভাইরোসের বাহক পোকা (সাদা মাছি) দমনের জন্য ডাইয়মেথোয়েট (পারফেকথিয়ন), এসাটাফ, এডমায়ার, টিডো ইত্যাদি যে কোন একটি বালাইনাশক ব্যবহার করা।\r\nছোট ছিদ্রযুক্ত নাইলনের নেট দিয়ে বীজতলা ঢেকে চারা উৎপাদন করা।', 5),
(9, 'D10.jpg', 'রোগের নামঃ', 'বেগুনের ফল বিকৃতি সমস্যা রোগ', 'লক্ষণঃ', 'কখনও কখনও ফলের আকার বিকৃতি ঘটে যার কারণে বেগুনের বাজার মূল্য কমে যায়।\r\nএর কারণ এখনও জানা যায়নি।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'জমিতে নিয়মিত সেচ দেওয়া।\r\nসুষম সার ব্যবহার করা।\r\nসঠিক দুরত্বে চারা রোপন করা।', 5),
(10, 'D11.jpg', 'রোগের নামঃ', 'বেগুনের ভাইরাসজনিত মোজাইক রোগ', 'লক্ষণঃ', 'এ রোগ হলে গাছে হলুদ ও গাঢ় সবুজ ছোপ ছোপ মোজাইক করা পাতা দেখা দেয় এবং পাতা কুঁকড়ে যায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'ক্ষেত থেকে আক্রান্ত গাছ তুলে পুতে ফেলা/ ডাল কেটে দেয়া\r\nজাব পোকা এ রোগের বাহক, তাই এদের দমনের জন্য ইমিডাক্লোরোপ্রিড ১ মি.লি. / লি. হারে পানিতে মিশিয়ে স্প্রে করা।', 5),
(11, 'D12.jpg', 'রোগের নামঃ', 'ফুলকপির কার্ড পচা রোগ', 'লক্ষণঃ', 'সাধারণত ছত্রাক আক্রান্ত ফুলকপির কার্ডে প্রথমে বাদামী রংয়ের গোলাকার দাগ দেখা যায় ।\r\nপরে একাধিক দাগ মিলে বড় দাগ হয় এবং কার্ড পচে যায় ।\r\nব্যাকটেরিয়ার আক্রমণ হলে কার্ড দ্রুত পচে যায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'কার্বেন্ডাজিম গ্রুপের ছত্রাক নাশক ১ গ্রাম/ লি. হরে পানিতে মিশিয়ে স্প্রে করা ( স্প্রে করার পর এক সপ্তাহ পর্যন্ত কপি তোলা যাবেনা ) ।\r\nএকই জমিতে বার বার কপি জাতীয় ফসল চাষ করবেন না।\r\nআক্রান্ত ক্ষেতে থেকে বীজ সংগ্রহ করবেন না।\r\nবপনের আগে প্রতি কেজি বীজে ২-৩ গ্রাম প্রোভ্যাক্স বা কার্বেন্ডাজিম মিশিয়ে বীজ শোধন করে নিন।\r\nলাল মাটি বা অম্লীয় মাটির ক্ষেত্রে শতাংশ প্রতি চার কেজি হারে ডলোচুন প্রয়োগ করুন (প্রতি তিন বছরে একবার)।', 5),
(12, 'D13.jpg', 'রোগের নামঃ', 'ফুলকপির গোড়া পচা রোগ', 'লক্ষণঃ', 'আক্রান্ত চারার গোড়ার চারদিকে পানিভেজা দাগ দেখা যায় ।\r\nগোড়ার সাদা ছত্রাকজালি ও অনেক সময় সরিষার মত ছত্রাকের অনুবীজ পাওয়া যায় ।\r\nশিকড় পচে যায়, চারা নেতিয়ে পড়ে গাছ মারা যায় ।\r\nস্যাতস্যাতে মাটি ও মাটির উপরিভাগ শক্ত হলে রোগের প্রকোপ বাড়ে ।\r\nরোগটি মাটিবাহিত বিধায় মাটি, আক্রান্ত চারা ও পানির মাধ্যমে বিস্তার লাভ করে ।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'পরিমিত সেচ ও পর্যাপ্ত জৈব সার প্রদান করা ও পানি নিস্কাশনের ভাল ব্যবস্থা রাখা\r\nসরিষার খৈল ৩০০ কেজি/ হেঃ হারে জমিতে প্রয়োগ করা।\r\nপ্রতি লিটার পানিতে ইপ্রোডিয়ন বা কার্বেন্ডাজিম গ্রুপের ছত্রাকনাশক যেমন: রোভরাল ২ গ্রাম বা ব্যাভিস্টিন ১ গ্রাম হারে মিশিয়ে স্প্রে করে মাটিসহ ভিজিয়ে দেয়া।\r\nবীজতলায় হেঃ প্রতি ২.০ টন ট্রাইকো-কম্পোস্ট ব্যবহার করা ।\r\nএকই জমিতে বার বার কপি জাতীয় ফসল চাষ করবেন না।\r\nদিনের বেশির ভাগ সময় ছায়া পড়ে এমন জমিতে কপি জাতীয় ফসল চাষ করবেন না।\r\nবপনের আগে প্রতি কেজি বীজে ২-৩ গ্রাম প্রোভ্যাক্স বা কার্বেন্ডাজিম মিশিয়ে বীজ শোধন করে নিন।\r\nলাল মাটি বা অম্লীয় মাটির ক্ষেত্রে শতাংশ প্রতি চার কেজি হারে ডলোচুন প্রয়োগ করুন (প্রতি তিন বছরে একবার)\r\nবীজ বপনের আগে বীজতলায় বা ক্ষেতে শুকনো কাঠের গুড়া ৩ ইঞ্চি পুরু করে বিছিয়ে পোড়ানো।\r\nমাটি সোলারাইজেশন করা- রোদের সময় মাটি পলিথিন দিয়ে ঢেকে রাখা।', 5),
(13, 'D14.jpg', 'রোগের নামঃ', 'ঢেঁড়শের পাতার মোজাইক \r\nও শিরা স্বচ্ছতা রোগ ', 'লক্ষণঃ', 'সব পাতা হলুদ ও সবুজ রঙের ছোপ ছোপ দেখা যায়।\r\nপাতার শিরাগুলো স্বচ্ছ ও হলুদ হয়ে যায়।\r\nগাছের পাতা ছোট ও খর্বাকৃতি হয়।\r\nআক্রান্ত পাতার উপর হলদে ও গাঢ় সবুজ মিশ্র মোজাইক দাগ পড়ে এবং পাতার শিরা সাদা দেখায়।\r\nদূর থেকে সমগ্র আক্রান্ত মাঠ হলদে বলে মনে হয়।\r\nভাইরাসের বাহক পোকা সাদা মাছি এ রোগ ছড়ায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'আক্রান্ত গাছ দেখা মাত্র তুলে নষ্ট অথবা পুড়ে ফেলা।\r\nআক্রান্ত ক্ষেত থেকে বীজ স সংগ্রহ না করা।\r\nরোগ প্রতিরোধ ক্ষমতা সম্পন্ন জাতের চাষ করা।\r\nবাহকপোকা (জ্যাসিড/সাদা মাছি) দমনের জন্য অনুমোদিত বালাইনাশবক ব্যবহার করা যথা সবিক্রণ- ২ মিঃ লিঃ বা এডমায়ার ০.৫ মিঃলিঃ) প্রতি লিটার পানি।\r\nইমিডাক্লোপ্রিড ০.৫ মিলি প্রতি লিটারে অথবা থাইয়ামোথোক্সাম ০.৫ গ্রাম প্রতি লিটারে মিশিয়ে সাত দিন পরপর স্প্রে করলে এই রোগের বাহক সাদা মাছি দমন করে এই রোগ অনেকাংশেই দমন করা যায়।', 5),
(14, 'D15.jpg', 'রোগের নামঃ', 'ঢেঁড়শের সুটিমোল্ড রোগ', 'লক্ষণঃ', 'এ রোগের আক্রমনে পাতায় , ফলে ও কান্ডে কাল ময়লা জমে। মিলিবাগ বা সাদা মাছির আক্রমন এ রোগ ডেকে আনে।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'আকান্ত পাতা ও ডগা ছাটাই করে ধ্বংস করা।\r\nটিল্ট ২৫০ ইসি ১০ লি. পানিতে ৫ মি.লি. মিশিয়ে ১৫ দিন পরপর ২ বার স্প্রে করা।\r\nআক্রান্ত গাছ থেকে বীজ সংগ্রহ করবেন না।\r\nআগাম বীজ বপন করা।\r\nসুষম সার ব্যবহার করা।\r\nরোগ প্রতিরোধী জাত যেমন: বারি জাতের ঢেড়শ চাষ করা।', 5),
(15, 'D16.jpg', 'রোগের নামঃ', 'করলার লিফ কার্ল রোগ', 'লক্ষণঃ', 'এটি একটি ভাইরাস জনিত রোগ।\r\nসাদা মাছি দ্বারা ভাইরাস ছড়ায় ।\r\nআক্রান্ত গাছ খর্বাকৃতি হয় ।\r\nপাতার গায়ে টেউয়ের মত ভাজের সৃষ্টি হয়, কুঁচকে যায় ।\r\nবয়স্ক পাতা পুরু ও মচমচে হয়ে যায় ।\r\nঅতিরিক্ত শাখা প্রশাখা বের হয় ও ফুল ফল ধারণ ক্ষমতা হারিয়ে ফেলে ।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'আক্রান্ত গাছ সংগ্রহ করে ধ্বংস করা ।\r\nরোগমুক্ত গাছ থেকে বীজ সংগ্রহ করা ।\r\nরোগ প্রতিরোধ ক্ষমতা সম্পন্ন জাত ব্যবহার করা ।\r\nভাইরাসের বাহক পোকা দমনেহার জন্য ডায়ামেথেয়ট, এসাটাফ, এডমেয়ার, টিডো, ইত্যাদি যে কোন একটি ১ মিলি /লিটার হারে পানিতে মিশিয়ে স্প্রে করা) ।\r\nরোগমুক্ত বীজ বপন করা।\r\nসুষম সার ব্যবহার করা।', 5),
(16, 'D17.jpg', 'রোগের নামঃ', 'শসা ডাউনি মিলডিউ রোগ', 'লক্ষণঃ', 'এ রোগ পাতায় হয়। পাতার উপরে ছোট ছোট হলুদ কোণাকৃতি দাগ দেখা যায়।\r\nপাতার নিচে গোলাপী ছত্রাক দেখা যায়।\r\nবয়স্ক পাতা মারা যায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'আক্রান্ত গাছ থেকে বীজ সংগ্রহ না করা।\r\nগাছের পরিত্যাক্ত অংশ সংগ্রহ করে নষ্ট বা পুড়ে ফেলা।\r\nডাইথেন-এম ৪৫ ২.৫ গ্রাম এবং ম্যানকোজেব + মেটালেক্সিল- ২ গ্রাম প্রতি লিটার পানিতে মিশিয়ে স্প্রে করা। সিকিউর ১-১.৫ গ্রাম প্রতি লিটার পানিতে মিশিয়ে স্প্রে করলে ভাল ফল পাওয়া যায়।', 5),
(17, 'D18.jpg', 'রোগের নামঃ', 'মিষ্টি কুমড়ার স্ক্যাব রোগ', 'লক্ষণঃ', 'পাতা, কান্ড ও লাউয়ের গায়ে ক্ষত দেখা যায় ।\r\nগাছের পাতা শুকিয়ে যায়।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'ক্ষেতে পানি নিস্কাষনের সুব্যবস্থা করা ।\r\nরিডোমিল গোল্ড ২ গ্রাম/প্রতি লিটার পানি মিশিয়ে স্প্রে করা ।\r\nআক্রান্ত ক্ষেত থেকে বীজ সংগ্রহ করবেন না।\r\nএকই জমিতে পর পর বার বার কুমড়া জাতীয় ফসল চাষ করবেন না\r\nক্ষেতে সুষম সার প্রয়োগ করুন।', 5),
(18, '463631352_dis312.jpg', 'রোগের নামঃ', 'আলুর দাদ বা স্ক্যাব রোগ', 'লক্ষণঃ', 'হালকা দাদ হলে উিউবারের উপরে উঁচু এবং ভাসা বিভিন্ন আকারের বাদামী দাগ পড়ে।\r\nরোগের গভীর দাদে গোলাকার গর্ত বা ডাবা দাগ পড়ে।\r\nদাঁদ রোগে আলুর উপরে উঁচু অমসৃণ বিভিন্ন আকারের বাদামী খস্খসে দাগ পড়ে। আক্রমণ বেশী হলে পুরো আলু দাগে ভরে যায় এবং অনেক সময় দাগগুলো ডেবে যায়।\r\nরোগের আক্রমণ সাধারণত ত্বকেই সীমাবদ্ধ থাকে। উচ্চ তাপমাত্রা এবং উচ্চ আর্দ্রতা এ রোগ বিস্তারে সহায়ক।\r\nএ রোগটি বীজ ও মাটি বাহিত। কোন পোষক গাছ ছাড়াই এ রোগের জীবাণু মাটিতে পাঁচ (৫) বছরের অধিক কাল পর্যন্ত বেঁচে থাকতে পারে।\r\nসাধারণত গাছে আলু আসার সময় কম পক্ষে ৩০ দিন পর্যন্ত যদি জমিতে পর্যাপ্ত রস না থাকে অথবা আলু গাছের বয়স ৬৫ দিন পর যদি জমিতে অতিরিক্ত রস থাকে তাহলে এ রোগটি বেশী হয়।\r\nবিভিন্ন প্রকার ফসল যেমন-মুলা, গাজর, শালগমে এ রোগের জীবাণু বহুদিন বেঁচে থাকে।', 'সমন্বিত দমন ব্যবস্থাপনাঃ', 'রোগমুক্ত বীজ ব্যবহার করা।\r\nজমিতে বেশী মাত্রায় ইউরিয়া ব্যবহার কমানো।\r\nবরিক এসিড ৩ গ্রাম + ১ লিটার পানি মিশিয়ে বীজ শোধন করা বা বীজের গায়ে ¯েপ্র করা।\r\n১ লিটার পানি মিশিয়ে বীজ শোধন করজমিতে হেক্ট প্রতি ১২০ কেজি জিপসাম সার ব্যবহার করা।\r\nএ রোগে আক্রান্ত আলু কখনই বীজ আলু হিসেবে ব্যবহার না করা।\r\nরোগ প্রতিরোধী বা সহনশীল জাত যেমন-বারি আলু-২৫, বারি আলু-২৮, বারি আলু-৩১, বারি আলু-৩৪, বারি আলু-৩৭, বারি আলু-৪০, বারি আলু-৪১, বারি আলু-৪৮, বারি আলু-৫০, বারি আলু-৫৩, বারি আলু-৫৬, বারি আলু-৫৭ এর চাষ করা।\r\nরোগমুক্ত বীজ ব্যবহার করা ও কন্দক রোপণের পূর্বে বীজআলু কোল্ড স্টোরেজ থেকে সংগ্রহের পর স্প্রাউটিং এর পূর্বে প্রোভে ২০০ (০.৩%) বা ডাইথেন এম-৪৫ (০.৩%) দিয়ে শোধন করে বপন করা।\r\nসুষম সার ব্যবহার করা।\r\nসেচের তারতম্যের কারণে অনেক সময় দাঁদ রোগের সূচনা হয়। দাঁদ রোগ নিয়ন্ত্রণের জন্য আলু লাগানোর ৩০-৩৫ দিন পর্যন্ত কোন অবস্থাতেই মাটিতে রসের যেন ঘাটতি না হয় সেদিকে লক্ষ্য রাখা।\r\nআলুর টিউবার ধারণের সময় ৩৫-৫৫ দিন পর্যন্ত পর্যাপ্ত সেচের ব্যবস্থা করা।\r\nআলু উত্তোলনের আগে মাটিতে বেশী রস থাকলে আলু দাঁদ রোগে আক্রান্ত হতে পারে, এ জন্য গাছের বয়স ৭০ দিনের পর সেচ বন্ধ করা।\r\nবীজ আলু চাষের পূর্বে জমিতে সরিষা, কাউন, সয়াবিন দ্বারা সবুজ সারে চাষ করা।\r\nশষ্য পর্যায়ে জমিতে গম বা ডাল জাতীয় ফসল চাষ করা।', 5);

-- --------------------------------------------------------

--
-- Table structure for table `equipment`
--

CREATE TABLE `equipment` (
  `p_id` int(11) NOT NULL,
  `p_image` varchar(255) NOT NULL,
  `p_name` varchar(255) NOT NULL,
  `p_weight` varchar(255) NOT NULL,
  `p_price` double NOT NULL,
  `offer` float NOT NULL,
  `titleone` varchar(255) NOT NULL,
  `desone` text NOT NULL,
  `titletwo` varchar(255) NOT NULL,
  `destwo` text NOT NULL,
  `titlethree` varchar(255) NOT NULL,
  `desthree` text NOT NULL,
  `p_cat` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `equipment`
--

INSERT INTO `equipment` (`p_id`, `p_image`, `p_name`, `p_weight`, `p_price`, `offer`, `titleone`, `desone`, `titletwo`, `destwo`, `titlethree`, `desthree`, `p_cat`) VALUES
(1, 'E1.jpg', 'ফেরোমন ট্র্যাপ', 'সঃখ্যা : ১ টি', 150, 0, 'পরিচিতিঃ', 'ফেরোমনের কার্যকারিতা অনেকটাই নির্ভর করে ব্যবহৃত ট্র্যাপের উপর। বাংলাদেশ কৃষি গবেষণা ইনস্টিটিউট কর্তৃক উদ্ভাবিত পানি ফাঁদ এর মৌলিক বিষয়গুলোকে বিবেচনায় নিয়ে ইস্পাহানি এগ্রো লিমিটেড তৈরী করেছে ফেরোমন ট্রাপ বা ফাঁদ যা ক্ষতিকারক বিভিন্ন পোকা দমনে অধিক কার্যকরী এবং টেকসই।', 'বৈশিষ্টঃ', 'এই ফাঁদটি বাংলাদেশ কৃষি গবেষণা ইনস্টিটিউটের অরিজিন ওয়াটার ট্র্যাপের মানদণ্ডে তৈরি\r\nফাঁদ দুটি অংশ সহ একটি বালতি মত দেখায়: ক্যাপ এবং বডি\r\nক্যাপ গোলাকার এবং রঙ লাল\r\nদেহটি স্বচ্ছ এবং দুটি দিক ত্রিভুজ আকারে কাটা\r\nপরিবহন সহজ\r\nসব ধরনের ফেরোমন কীটনাশক ব্যবহার করতে পারেন', 'ট্র্যাপে ফেরোমন টোপ ঝুলানো ও জমিতে স্থাপন পদ্ধতি:', 'ট্র্যাপ এর ত্রিকোণাকারভাবে কর্তিত অংশের মাঝ বরাবর তার দিয়ে ফেরোমন লিউর/ টোপটি ঝুলিয়ে দিতে হবে।\r\nট্র্যাপ এর তলায় গুড়া সাবান মিশ্রিত পানি এমনভাবে দিতে হবে যাতে টোপটি পানির ১ ইঞ্চি উপরে থাকে।\r\nত্রিকোণাকারভাবে কর্তিত অংশ উত্তর-দক্ষিণ বরাবর রাখা উত্তম।\r\n৪/৫ দিন পরপর মরা পোকাসহ সাবান মিশ্রিত পানি ফেলে নতুনভাবে গুঁড়া সাবান মেশানো পানি দিতে হবে।\r\nফুল ও ফল যে উচ্চতায় থাকে সে উচ্চতায় ফেরোমন ফাঁদটি দুটি খুঁটির সাহায্যে শক্তভাবে বেঁধে দিতে হবে অথবা গাছে ঝুলিয়ে দিতে হবে। ', 4),
(2, 'E2.jpg', 'নীল আঠালো ফাঁদ', 'সঃখ্যা : ১ টি', 120, 0, 'পোকামাকড় দমনের জন্য প্রযোজ্যঃ', 'থ্রিপস্, পাতা সুড়ঙ্গকারী পোকা (লিফ মাইনার) দমনে এটি কার্যকরী। নীল রং অন্য রং এর চাইতে বেশী আকর্ষনীয় হওয়ায় এটিতে উপকারী পোকা কম আকৃষ্ট হয়।', 'প্রয়োগ মাত্রাঃ', 'জমিতে ১০ মিটার দূরে দূরে এটি স্থাপন করতে হবে।\r\nবিঘা প্রতি (৩৩ শতাংশ) ১০ টি হলুদ আঠালো ফাঁদ ব্যবহার করতে হবে।\r\nআঠালো ফাঁদ মাঠে স্থাপনের পর প্রায় দুই মাস পর্যন্ত কার্যকরী থাকবে।', 'ব্যবহারে সাবধানতাঃ', 'শিশুদের নাগালের বাইরে রাখতে হবে।\r\nব্যবহারের পর ফাঁদগুলো যেখানে সেখানে না ফেলে সংগ্রহ করে পুড়িয়ে ফেলতে হবে।', 4),
(3, 'E3.jpg', '4 ইঞ্চি লোটাস প্লান্টার টব', '2', 150, 0, 'নাম: লোটাস প্ল্যান্টার', 'আকার: 4\"', 'ওজন: 0.018 কেজি প্রতি পিসি', 'প্রস্থ: 4\"', 'উচ্চতা: 3.1\"', 'রঙ: সাদা, লাল, সবুজ, কাঠ', 4),
(4, 'E4.jpg', 'লোটাস প্ল্যান্টার ৮', '২', 150, 0, 'সাইজ: ৮', 'প্রস্থ: ৮\"', 'উচ্চতা: ৭.৫\"', 'ওজন: 0.0৯২ কেজি প্রতি পিস', 'রঙ: সাদা, লাল, সবুজ', 'ব্র্যান্ড: (বিপি প্লাস্টিক)', 4),
(5, 'E5.jpg', 'বিপি প্লাস্টিক প্লান্টার টব ১৬ ইঞ্চি', '১', 100, 0, 'সাইজ: ১৬ ইঞ্চি', 'প্রস্থ: ১৬\"', 'উচ্চতা: ১৫\"', 'ওজন: 0.092 কেজি প্রতি পিস', 'রঙ: সাদা, লাল, সবুজ', 'ব্র্যান্ড: (বিপি প্লাস্টিক)', 4),
(6, 'E10.webp', 'সিডলিং ট্রে ৫০ হোল', '১', 300, 0, 'কোষের পরিমাণ - ৫০ টি গর্ত', 'ওজন - 120 গ্রাম', 'প্লাস্টিকের গুণমান- হার্ড', 'রঙ কালো', 'কম জায়গায় বেশি চারা', 'পানি ও সার সাশ্রয় ৫০% এর বেশি', 4),
(7, 'E12.webp', 'জিও ব্যাগ-6 গ্যালন', '১', 150, 0, 'ব্যবহার: শাকসবজি/ফুল/গাছ রোপণ', 'ক্ষমতা: ৬ গ্যালন', 'মাটির ক্ষমতা: ২৩ কেজি', 'মাত্রা: ১৩\"(D)*১১\"(H)', 'জিও ব্যাগ: মাটি ও প্লাষ্টিক এর তৈরি টবের বিকল্প। পরিবেশ বান্ধব। পানিতে নষ্ট হয়না।', 'টেকসই, পুনরায় ব্যবহারযোগ্য। \r\nপর্যাপ্ত বায়ু সঞ্চালনের মাধ্যমে শিকড়ের রোগ প্রতিরোধ ক্ষমতা বৃদ্ধি করে।', 4),
(8, 'T4.jpg', '১৩ ইঞ্চি গার্ডেন টুল সেট (৩ পিস সেট)', '৩', 300, 0, 'ওজন (প্রায়): ৪০০ গ্রাম', 'দৈর্ঘ্য ১৩ ইঞ্চি,কাঠের দৈর্ঘ্য ৫ ইঞ্চি।', 'মসৃণ ফিনিস কাঠের হাতল সঙ্গে কঠিন ধাতু নির্মাণ.', 'বাড়ির বাগান করার জন্য সরঞ্জাম হতে হবে।', 'উপকরণ: কাঠ এবং লোহা।', 'আপনার বাগানের প্রয়োজনের জন্য নিখুঁত টুল সেট', 4),
(9, '419870755_MINITZENI4WX3.jpg', 'সিকেচার – ৮ ইঞ্চি', '১', 300, 0, 'ওজন (প্রায়): ৪০০ গ্রাম', 'দৈর্ঘ্য ১৩ ইঞ্চি,কাঠের দৈর্ঘ্য ৫ ইঞ্চি।', 'মসৃণ ফিনিস কাঠের হাতল সঙ্গে কঠিন ধাতু নির্মাণ.', 'বাড়ির বাগান করার জন্য সরঞ্জাম হতে হবে।', 'উপকরণ: কাঠ এবং লোহা।', 'আপনার বাগানের প্রয়োজনের জন্য নিখুঁত টুল সেট', 4);

-- --------------------------------------------------------

--
-- Table structure for table `fertilizer`
--

CREATE TABLE `fertilizer` (
  `p_id` int(11) NOT NULL,
  `p_image` varchar(255) NOT NULL,
  `p_name` varchar(255) NOT NULL,
  `p_weight` int(11) NOT NULL,
  `p_price` int(11) NOT NULL,
  `offer` float NOT NULL,
  `titleone` varchar(255) DEFAULT NULL,
  `desone` text DEFAULT NULL,
  `titletwo` varchar(255) DEFAULT NULL,
  `destwo` text DEFAULT NULL,
  `titlethree` varchar(255) DEFAULT NULL,
  `desthree` text DEFAULT NULL,
  `p_cat` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `fertilizer`
--

INSERT INTO `fertilizer` (`p_id`, `p_image`, `p_name`, `p_weight`, `p_price`, `offer`, `titleone`, `desone`, `titletwo`, `destwo`, `titlethree`, `desthree`, `p_cat`) VALUES
(1, 'f1.jpg', 'বোরিক এসিড', 1, 150, 10, 'বোরনের ঘাটতি জনিত লক্ষণ :', 'গাছের কাণ্ডের শীর্ষ ভাগ শুকিয়ে যায় বা মরে যায়।\r\nপাতা ঈষৎ হলুদাভ হয় এবং কখনও কখনও পাতা মোড়ানো আকার ধারণ করে এবং ভঙ্গুরতা প্রদশর্ন করে।\r\nগাছে পর্যাপ্ত পানি সেচ দেয়ার পরও কচিপাতা নেতিয়ে পড়া অবস্থায় থাকে।\r\nডাল জাতীয় ফসলে দানা সংখ্যা কম হয় এবং দানা অপুষ্ট হয়।\r\nতৈল জাতীয় ফসলের পডে (শিম) বীজের সংখ্যা কমে যায়।\r\nপেঁপে, কাঁঠাল, পেয়ারা ফলের আকার বিকৃতি হয় ।', 'প্রয়োগ বিধি :', 'ফলজ বৃক্ষের ক্ষেত্রে- বাড়ন্ত ফলজ বৃক্ষের জন্য বোরন সার বছরে দুইবার প্রয়োগ করতে হবে।\r\n\r\nপ্রয়োজনীয় মাত্রার অর্ধেক বর্ষাকালের আগে এপ্রিল-মে মাসে এবং ২য় কিস্তি বৃষ্টির পরে সেপ্টেম্বর-অক্টোবর মাসে প্রয়োগ করতে হবে। গাছের গোড়া থেকে ০.৫ মিটার-১.৫ মিটার দূরে চার দিকে রিং পদ্ধতিতে প্রয়োগ করে হালকা সেচ দিতে হবে।', NULL, NULL, 3),
(2, 'f2.jpg', 'সুরক্ষা জৈব সার', 1, 240, 10, 'বৈশিষ্ট্য :', 'মাটির প্রান হিসাবে কাজ করে\r\nমাটিতে বাতাস চলাচল বৃদ্ধি করে\r\nগাছে পর্যাপ্ত পানি সেচ দেয়ার পরও কচিপাতা নেতিয়ে পড়া অবস্থায় থাকে;\r\nরাসায়নিক সারের পরিমান কমায়\r\nফসল সুস্বাদু হয় এবং ফলন বৃদ্ধি পায়\r\nমাটিতে পানির ধারন ক্ষমতা বৃদ্ধি করে', 'উপকারিতা :', 'আমরা জানি আদর্শ মাটিতে কমপক্ষে ৫% জৈবসার থাকা প্রয়োজন। সেখানে আমাদের দেশের মাটিতে আছে মাত্র ০.৫-১%। যা আমাদের ফসলের জন্য হুমকী স্বরুপ। আবার আমরা যারা ছাদবাগান করছি তারা জৈবসার যুক্ত মাটির অভাবে ঠিকভাবে গাছপালা জন্মাতে পাচ্ছি না। তাই মাটিতে সঠিক পুষ্টি উপাদান প্রদানের জন্য এসিআই জৈব সার ব্যবহার করতে পারেন। গুনগত মানের দিক থেকে এটি বর্তমানের বাজারের সেরা জৈবসার।এটি ট্রাইকোডার্মা সমৃদ্ধ হওয়ায় গাছের ছত্রাক জনিত রোগ কম হয়।', NULL, NULL, 3),
(3, 'f3.jpg', 'হিউমি স্টার', 1, 320, 5, 'বৈশিষ্ট্য :', 'মাটিতে বিদ্যমান সকল পুষ্টি উপাদানকে গাছের গ্ৰহন উপযোগী করে তোলে।\r\nমাটির সকল উপকারি অনুজীবকে সক্রিয় করে ফলে রাসায়নিক সারের কার্যকারিতা বৃদ্ধি পায়।\r\nবীজের অংকুরোদগম ক্ষমতা বৃদ্ধি করে এবং রোপনকৃত চারা খুব দ্রুত বেড়ে উঠে।\r\nমাটির গঠন উন্নত করে, উর্বরতা বৃদ্ধি করে এবং পি এইচ এর ভারসাম্য রক্ষা করতে সহায়তা করে।\r\nবিভিন্ন প্রতিকূল পরিবেশ (যেমন ক্ষরা, শৈত প্রবাহ ইত্যাদি) গাছের স্বাভাবিক বৃদ্ধি বজায় রাখে।', 'উপকারিতা :', 'আমরা জানি আদর্শ মাটিতে কমপক্ষে ৫% জৈবসার থাকা প্রয়োজন। সেখানে আমাদের দেশের মাটিতে আছে মাত্র ০.৫-১%। যা আমাদের ফসলের জন্য হুমকী স্বরুপ। আবার আমরা যারা ছাদবাগান করছি তারা জৈবসার যুক্ত মাটির অভাবে ঠিকভাবে গাছপালা জন্মাতে পাচ্ছি না। তাই মাটিতে সঠিক পুষ্টি উপাদান প্রদানের জন্য এসিআই জৈব সার ব্যবহার করতে পারেন। গুনগত মানের দিক থেকে এটি বর্তমানের বাজারের সেরা জৈবসার।এটি ট্রাইকোডার্মা সমৃদ্ধ হওয়ায় গাছের ছত্রাক জনিত রোগ কম হয়।', NULL, NULL, 3),
(4, 'f4.jpg', 'রেডি মিক্স সয়েল', 5, 100, 15, 'রেডি মিক্স মাটিতে আছেঃ', 'মাটি\r\nভার্মি কম্পোস্ট\r\nকোকো ডাস্ট\r\nহাড়ের গুড়া\r\nশামুকের গুড়া\r\nসিলেটি বালি\r\nলাইমস্টোন\r\nভূষি\r\nগোবর সার\r\nচা পাতার গুড়া\r\nকয়লার গুড়া\r\nবরিক পাউডার\r\nজিংক', 'উপকারিতা :', 'রেডিমিক্স সয়েল ব্যবহার করলে আপনার বাগানে পরবর্তী ৬ মাস পর্যন্ত কোন ধরনের সার প্রয়োগ করতে হবে না। এছাড়াও মাটিতে বসবাসকারী উদ্ভিদের ক্ষতিকর জীবাণু যেমন- ছত্রাক, ব্যাকটেরিয়া ও নেমাটোডকে মারতে এই রেডিমিক্স সয়েল কার্যকরী ভূমিকা পালন করে। তাছাড়া পরিমিত পরিমানে সকল পুষ্টি উপাদান এ মাটিতে বিদ্যমান থাকার দরূন গাছের দ্রুত বৃদ্ধিতে সহায়তা করে।', NULL, NULL, 3),
(5, 'f5.jpg', 'বাম্পার রুটগ্রো', 1, 150, 0, 'বৈশিষ্ট্য :', 'ফসলের মূলের দ্রুত গঠন ও বৃদ্ধিতে সহায়তা করে।\r\nশিকড় বৃদ্ধি করে ও ফসলের পুষ্টি উপাদান গ্রহনে সহায়তা করে\r\nফসলের মূলের সংখ্যা বৃদ্ধি করে।\r\nসঠিক সময়ে বীজের অংকুরোদগম হতে সহায়তা করে।\r\nফসল সুস্বাদু হয় এবং ফলন বৃদ্ধি পায়।\r\nমাটিতে পানির ধারন ক্ষমতা বৃদ্ধি করে।', 'উপকারিতা :', 'আমরা জানি আদর্শ মাটিতে কমপক্ষে ৫% জৈবসার থাকা প্রয়োজন। সেখানে আমাদের দেশের মাটিতে আছে মাত্র ০.৫-১%। যা আমাদের ফসলের জন্য হুমকী স্বরুপ। আবার আমরা যারা ছাদবাগান করছি তারা জৈবসার যুক্ত মাটির অভাবে ঠিকভাবে গাছপালা জন্মাতে পাচ্ছি না। তাই মাটিতে সঠিক পুষ্টি উপাদান প্রদানের জন্য এসিআই জৈব সার ব্যবহার করতে পারেন। গুনগত মানের দিক থেকে এটি বর্তমানের বাজারের সেরা জৈবসার।এটি ট্রাইকোডার্মা সমৃদ্ধ হওয়ায় গাছের ছত্রাক জনিত রোগ কম হয়।', NULL, NULL, 3),
(6, 'f6.jpg', 'কোকো ডাস্ট', 3, 100, 0, 'বৈশিষ্ট্য :\r\n', 'কোকো ডাস্ট বা নারকেল ধুলো একটি প্রাকৃতিক ক্রমবর্ধমান মাধ্যম যা নারকেলের তুষ থেকে বের করা হয়। উচ্চ জল এবং পুষ্টি ধরে রাখার ক্ষমতা এবং হালকা ওজনের কারণে এটি মাটির একটি ভাল বিকল্প হয়ে উঠেছে। এই জৈব, পুনর্নবীকরণযোগ্য স্তরটি অপেশাদার এবং পেশাদার উদ্যানপালকদের মধ্যে জনপ্রিয়তা অর্জন করেছে।\r\n', 'বাগান করার জন্য আপনার কেন কোকো ডাস্ট ব্যবহার করা উচিত?', 'প্রাথমিক কারণটি হবে হালকা ওজন এবং জল ধারণ ক্ষমতা, কারণ বেশিরভাগ শহুরে উদ্যানপালক বাগান করার জন্য ছাদ ব্যবহার করেন। সুতরাং, ওজন সেখানে একটি সমস্যা। আপনি যদি 50 ড্রামে নিয়মিত মাটি ব্যবহার করেন তবে এটি একটি বিশাল ওজন হবে। বাংলাদেশের অনেক এলাকার জন্য পানির সংকট একটি বিদ্যমান সমস্যা, যখন আপনি নিয়মিত বাগানের মাটির বিকল্প মাধ্যম হিসেবে কোকো ডাস্ট ব্যবহার করেন, তখন আপনি নিয়মিত মাটির তুলনায় 70% পানির ব্যবহার বাঁচাতে পারবেন।', NULL, NULL, 3),
(7, 'f7.jpg', 'ভার্মিকম্পোস্ট', 2, 240, 0, 'বৈশিষ্ট্য :\r\n', 'এ আর এগ্রো কেঁচো (ভার্মিকম্পোস্ট) সার একটি পরিবেশ বান্ধব উন্নত প্রাকৃতিক জৈব সার।\r\nএ আর এগ্রোভার্মি কম্পোস্ট (কেঁচো সার) মাটির অণুজৈবিক ক্ষমতা বৃদ্ধি করে, গাছের জন্য প্রয়োজনীয় খাদ্য উপাদানের প্রায় সব গুলো উপাদান থাকায় গাছের দ্রুত বৃদ্ধি হয় ।\r\nএ আর এগ্রো কেঁচো সারজৈব পদার্থের পরিমাণ অন্য জৈবসারের তুলনায় অনেক বেশি থাকে, যা মাটির জন্য খুব উপকারী এবং মাটিতে পানির ধারণক্ষমতা বৃদ্ধি করে এবং মাটির তাপমাত্রা, আদ্রতা ও অম্লতা নিয়ন্ত্রণ করে।\r\nএ আর এগ্রোকেঁচো সার মাটির পিএইচের মাত্রা নিয়ন্ত্রণসহ মাটির বিষক্রিয়া দূর করে।', 'প্রয়োগ বিধি :\r\n', 'গাছ লাগানোর পূর্বেই মাটি প্রস্তুত করার সময় একটি ২০ ইঞ্চি টবের ক্ষেত্রে মাটির তিন ভাগের এক ভাগ কেঁচো সার একত্রে মিশাতে হবে । গাছ লাগানোর ৪/৫ মাস পর থেকে গাছ প্রতি ২০০ গ্রাম ভার্মি কম্পোষ্ট সার ২ মাস অন্তর অন্তর গাছের গোড়ায় মাটি খুচিয়ে প্রয়োগ করুন ।\r\n\r\nশহরে অবস্থানের কারণে যাদের গোবর সার সংগ্রহে সমস্যা আছে তাদের জন্য কেঁচো সার আশির্বাদ বলা চলে । কারণ গোবর সারের পরিবর্তে মাটির সংগে শুধুমাত্র কেঁচো সার প্রয়োগ করেও যে কোন গাছ লাগানো যায় । ভার্মিকম্পোষ্ট সার ব্যাবহার করা সহজ, যে কারণে ছাদে বাগানের জন্য উক্ত সার ব্যবহার করতে পারেন ।\r\n\r\n', NULL, NULL, 3),
(8, 'f8.jpg', 'রেডি মিক্স সয়েল', 100, 7250, 0, 'বৈশিষ্ট্য :', 'রেডি মিক্সড মাটি জৈব মাটি।\r\nসম্পূর্ণ ম্যাশিনে রিফাইনকৃত।\r\nউদ্ভিদের পুষ্টি উপদানের অভাব পূরণে সহয়তা করে ।\r\nগাছের সুষম বৃদ্ধি ও ফলন ভাল হয়।\r\nমাটি ঝুরঝুরে হওয়ায় বায়ু ও পানি সহজে প্রবেশ করতে পারে ।\r\nশিকড় দ্রুত বৃদ্ধি পায় এবং মজবুত হয়।\r\nরেডিমিক্স মাটি ব্যবহারে আলাদাভাবে সার প্রয়ােগ করতে হয় না ফলে খরচের সাশ্রয় হয়।', 'উপকারিতা :', 'রেডিমিক্স সয়েল ব্যবহার করলে আপনার বাগানে পরবর্তী ৬ মাস পর্যন্ত কোন ধরনের সার প্রয়োগ করতে হবে না। এছাড়াও মাটিতে বসবাসকারী উদ্ভিদের ক্ষতিকর জীবাণু যেমন- ছত্রাক, ব্যাকটেরিয়া ও নেমাটোডকে মারতে এই রেডিমিক্স সয়েল কার্যকরী ভূমিকা পালন করে। তাছাড়া পরিমিত পরিমানে সকল পুষ্টি উপাদান এ মাটিতে বিদ্যমান থাকার দরূন গাছের দ্রুত বৃদ্ধিতে সহায়তা করে।', NULL, NULL, 3),
(9, '950336822_f10.jpg', 'বাম্পার সুরক্ষা জৈব', 5, 250, 0, 'বৈশিষ্ট্য :', 'মাটির প্রান হিসাবে কাজ করে। ঝরঝরে ও গন্ধবিহীন আগাছার বীজমুক্ত। মাটিতে বাতাস চলাচল বৃদ্ধি করে। রাসায়নিক সারের পরিমান কমায়।\r\nফসল সুস্বাদু হয় এবং ফলন বৃদ্ধি পায়। মাটিতে পানির ধারন ক্ষমতা বৃদ্ধি করে। গাছে অধিক পরিমানে ফুল ও ফল ধরায়।', 'উপকারিতাঃ', 'বাম্পার জৈব সার সঠিক ভাবে মান নিয়ন্ত্রিত হওয়ায় মাটিতে জৈব পদার্থের ঘাটতি দ্রত পূরন হয়। ফসলের পুষ্টি উপাদানের আধাঁর ঘর হিসেবে কাজ করে, ফলে গাছ সহজে পুষ্টি উপাদান গ্রহন করতে পারে।রাসায়নিক সারের কার্যকারিতা বৃদ্ধি পায়, ফলে ২৫% পর্যন্ত রাসায়নিক সার কম লাগে। মাটির পানি ধরন ক্ষমতা বৃদ্ধি পায়, ফলে জমির উর্বরতা শক্তি বাড়ে ও সেচ খরচ কমে। \r\n ট্রাইকোডার্মা সমৃদ্ধ হওয়ায় ফসলে মাটি বাহিত রোগ কম হয়। প্রয়োগমাত্রা কম হওয়ায় জমিতে সহজে প্রয়োগ করা যায়।', '', '', 3);

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `order_id` int(11) NOT NULL,
  `cusname` varchar(255) NOT NULL,
  `cusemail` varchar(255) NOT NULL,
  `cusphn` bigint(20) NOT NULL,
  `cusadd` varchar(255) NOT NULL,
  `product` varchar(255) NOT NULL,
  `category_name` varchar(255) NOT NULL,
  `status` varchar(255) NOT NULL,
  `total_price` double NOT NULL,
  `paymode` tinytext NOT NULL,
  `img` varchar(255) NOT NULL,
  `order_time` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `send` tinyint(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`order_id`, `cusname`, `cusemail`, `cusphn`, `cusadd`, `product`, `category_name`, `status`, `total_price`, `paymode`, `img`, `order_time`, `send`) VALUES
(47, 'shuvo', 'abulbashershuvo@gmail.com', 1912819727, 'savar', 'বাম্পার রুটগ্রো', 'fertilizer', 'transporting', 150, 'SSLCZ_TEST_649bbf97d9caf', 'f5.jpg', '2023-08-18 22:02:43', 0),
(48, 'shuvo', 'abulbashershuvo@gmail.com', 1912819727, 'savar', 'রতন', 'seed', 'pending', 100, 'SSLCZ_TEST_649bc092625e3', 's14.jpg', '2023-06-28 15:48:21', 0),
(49, 'shamim', 'shamimahmed82245@gmail.com', 1758175814, 'kunipara', 'ভার্মিকম্পোস্ট', 'fertilizer', 'transporting', 240, 'SSLCZ_TEST_649bfd766f342', 'f7.jpg', '2023-08-17 10:39:16', 0),
(53, 'shamim', 'shamimahmed82245@gmail.com', 1758175814, 'kunipara', 'করলা', 'seed', 'pending', 100, 'SSLCZ_TEST_64df3a38db539', 's1.jpg', '0000-00-00 00:00:00', 0);

-- --------------------------------------------------------

--
-- Table structure for table `password_reset`
--

CREATE TABLE `password_reset` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `password_reset`
--

INSERT INTO `password_reset` (`id`, `email`, `token`) VALUES
(1, 'shamimahmed82245@gmail.com', '2147483647'),
(2, 'shamimahmed82245@gmail.com', '0'),
(3, 'shamimahmed82245@gmail.com', '0'),
(4, 'shamimahmed82245@gmail.com', '62922a6f334c31eba10dd815ea768dcf059cb4aafdd6fc2fa1947cf7be3e3773626d595fb2cf976a7fde3e7a8c5020791f16'),
(5, 'shamimahmed82245@gmail.com', '9fa4f5fa42c4008ff95f8fcca3ddd6e4789540b50ac773689e01c1c57585f5df7d2f323b4837863a1e4773b33a1f33c79666'),
(6, 'abulbashershuvo@gmail.com', 'c232191cb16fb9142ac14e74ed65feb87a86758dc260e8e9e3e366e34a2c724b00252e258de02b51cc24d5449d2e952ca96b'),
(7, 'abulbashershuvo@gmail.com', '2a09b10a97a40a1fc56be87170341b662b67024af20b35a653e21740ef14b72bd9442427c6485532e3bc493315746e7a248c'),
(8, 'abulbashershuvo@gmail.com', 'fe9da19da45234f113b91a2d391017c9ea81ff419aad623bac029c1f84d88300e04a8cd4eb9eb7863bb8519425a99016cd3a'),
(9, 'abulbashershuvo@gmail.com', 'c4a7f4c6eea91fdacaec10d7029ad8ac1998e3b1fdd793e7e3f32e6f38fe9d1615a03ac29b72a545ea2d1c6f22f90de1ee7c'),
(10, 'abulbashershuvo@gmail.com', 'f79ccd157b7b7ed1e76d75c1710310320002178bfedc6c3f5a7d7b8c9d97a2584792b2afe0ace5577c23887bbd77a8d144b3'),
(11, 'abulbashershuvo@gmail.com', '116758fc5a87eee6e931655ab1077b722ad58402de36c2b8a12c777c016f309f257a5b1e4ee8ede6cb85fa798e1a37524364'),
(12, 'abulbashershuvo@gmail.com', '5c626f1dc3e80d78069550bc0255348a8987ffe93737c9e5f00cf140671e963f05d4dac3ed2d6d267fc74bb2b9f9b0300709'),
(13, 'abulbashershuvo@gmail.com', 'cfd86bdaff654de2605204b820ffa1b795f6325940734bfa36561d0d3d117b73d766d666b7ec5d6e295d9c53e6d17b8f3527'),
(14, 'abulbashershuvo@gmail.com', '434b7b6b6b934cfa6a46bed334b2cb7d21f7f8e43ea919527ee31065cfee3522b73e77e36abf5ec796100b90d59e3a9f96c6'),
(15, 'abulbashershuvo@gmail.com', '6bed915546d3d828d84ad109aca01b286d1aca359a3d863889439c375b78bdbdc44781550833e0e33bc6a343cca714dc2428'),
(16, 'abulbashershuvo@gmail.com', 'e5c5ccaa1f2d5790e4abf625a8e6149763f8fc5f252341b727e666bbab3f590ccd19596b670ea32e1421a5958793b41e0781'),
(17, 'b190305006@cse.jnu.ac.bd', '87f666299d53dad8b1f5a81b65c34a77c633a90ce43c82b6085e15bd9ead43a963f5319579f07b65b15b3f3faa162031069e'),
(18, 'b190305006@cse.jnu.ac.bd', '15d2a915a595490e600f07e176f20052712274df23a259ab09913dd82ab4b2b1189695336f484e0b9a493cee298e85bb14ba'),
(19, 'b190305006@cse.jnu.ac.bd', '8c4dcc8a12c08f1addf45cc925de5204f5512954f57bac66f8cdbd743df7f3dfdea5521bbc83e4874d3cb54083bd38dfe472'),
(20, 'b190305006@cse.jnu.ac.bd', 'd8c991a60b6c549a334b855e80e6c1ee57dcff8b98557bd0773fa17b93a0303acbbb9668eabb119ca5e2ee5c3c4a66bc4ae4'),
(21, 'abulbashershuvo@gmail.com', 'c6ef87590a8fc19ac79ad42fd1d09eaf10199262ee97f704179cbb927da65695e3a1f159ecb21ff24479c829484e91a87267'),
(25, 'abulbashershuvo@gmail.com', '28d353db1641a38c492923da12baad868807e26ee39b2e0cc8e00e8533ddefb0c3d4786c89c590e9d486bb4466ffc205d61e'),
(26, 'b190305006@cse.jnu.ac.bd', '3356deb9a2a70db5341840a376ac0ee86de8fe00652a8cf47e8f22bb00007d42d3f59b03798a74f996edefe8f28556ff7c86'),
(27, 'b190305006@cse.jnu.ac.bd', '782d725430890ac78856b42f9705fc684c08fb795b5e3e14f3b1fe06edd92fded880b3dae75aa260eca27cbfe01e1ec50f7f'),
(28, 'abulbashershuvo@gmail.com', '0784b339e401472454e2f7ae73cc4275f5212b1b5597615e2579c94cd9992b11f758f96bb5e528e71509920a2b461875367e'),
(29, 'shamimahmed82245@gmail.com', '45f6ab550df8185a5e76301f9f18f9631cdd45525a721a1c71ecc258cc826e172dc50b97c7814e7908847d359771413eb858'),
(30, 'shamimahmed82245@gmail.com', '9ed0f0e986780a849f2c124ee575c12d8701f4c4acab3419bd86f5706b5ac6b0842e6f7ac8fb4900ea93457e9073993460a2'),
(31, 'abulbashershuvo@gmail.com', '8061214b3a5fa2c231088e97fd2a227bb2f05a88142f1c5627b39e4a30d150e02e5138e64cf6ea4aea66759c4dabd6bc2e4a'),
(32, 'abulbashershuvo@gmail.com', 'dc92dc8debebe85cf78ba4f27b37003935910e8e65171df636cdf3a1f7b79a2004af36d38aa72866213b875db669a2dd3d60'),
(33, 'abulbashershuvo@gmail.com', 'ea8a440f923c2f44f2f216c82aa43c687738af1c7870f5497144f933e8dd904d7325f54dc0b5b3cc47effc7e1daddcdd125d'),
(34, 'abulbashershuvo@gmail.com', '9a5a7656652b1406fe2a21e17a609c4060fa6805d25dd548e462386a617058e3217ede58ca48acd499a80b031f58009b52c9'),
(35, 'b190305006@cse.jnu.ac.bd', '4433b8d2ade3e7e07ee6dc8ed9b08179d659bed1489f24c44e4b93a8bad5ca8a762a60b129f4c2065bf714907eaccf65d29a'),
(36, 'b190305006@cse.jnu.ac.bd', 'bf836576b2f8cfd9e850bac8fb8710c042d43603cb37b9474070896580c759b1a075ee24a7155ab23ed79fbc00993b52a5c9'),
(37, 'b190305006@cse.jnu.ac.bd', '7c1c39a94e4cb4d02b716d3c2cd7159c5ad2dc3777a82168ec49d567ac57f576a409fd01c50df259c30a31f12c687cbcb5d7'),
(38, 'b190305006@cse.jnu.ac.bd', '2da4a293f25027e7a81e1de059e5c989e6f68deb67f7fea26b711171fe69beff7d6a5236873ce570e81f03b726297241cfb2'),
(39, 'b190305006@cse.jnu.ac.bd', '7c77aee6791b7998dafa3fcb4fadf85e6d4d6e8851763dd89a20cec79f37990d9c739cba5f4d16c400700652adf283b793e5'),
(40, 'b190305006@cse.jnu.ac.bd', '88ec94496384935560a7f56bf32468e9d1aa3770e1e3e6926cc2f6464078ab731e6ed57186f4f09cde6dd3fea83feba50ba0'),
(41, 'b190305006@cse.jnu.ac.bd', '6308241af15d353510eeca1633206679b53cb41ae1507367f987b312d2edab7375bb13ece49ee42c1cc1e7b48b03a3281e9a'),
(42, 'b190305006@cse.jnu.ac.bd', '5edffae472e60845cfe6d1ca4fb8ef777f7ab2c42d355fe32ffa9b1f1f9d4635fb974a94b5edd95e40c70d1415fa86dd4a05'),
(43, 'b190305006@cse.jnu.ac.bd', 'a52e4e7054cc4db29fc6180e1f289152cf339c398ee462861aa88c75d5e5eb9cd62b173dee2482fcc05fb998478506548e30'),
(44, 'b190305006@cse.jnu.ac.bd', '4759a00c5b1b1c70557142e349e3286ed52056fc0216d33b27f55bf54afe700ffe7753eed402a95b9a852628243db86e8541'),
(45, 'b190305006@cse.jnu.ac.bd', 'e870e26674ddf265ca5eaacc3e33e19a053acbbf7f09b9cae4f5439508bfa434fab60b908fd82e487a0d6d4531edc8dc38bc'),
(46, 'b190305006@cse.jnu.ac.bd', 'f10c79eafae11178063cd56ecc3271e8000ae1ff7294e9d05c562211ff9d0b0dff761d806da934878ac1450e7eb62b30b8ae'),
(47, 'b190305006@cse.jnu.ac.bd', 'd81ef865eef6a17a5459deb278205f54f9ab96aafc9b4eb715a7ef8d8c5969943fe2f2345350da4b9843f22ce5340683a8ec'),
(48, 'b190305006@cse.jnu.ac.bd', 'a2f92b3c8a4dacb300696e0adba4d92c17de567f3c6291caa29fb9aa2df9852b74ba96deeff7adba0c32c4bd6382d86a1a3e'),
(49, 'b190305006@cse.jnu.ac.bd', 'd7354d8f3814caa45a93dfb48d2a0c69214c12c17a56e4341d51f06d19f1149472ca05b578d93d9bda37dae14d6642d49dda'),
(50, 'shamimahmed82245@gmail.com', 'd695466a0de6d059144310d36b7d273a299a70177f9799885453dccef70027d93e27da68387ebf9aeb890b4928a5a3b01288'),
(51, 'shamimahmed82245@gmail.com', '840c3d40ffa03130d2e23219faa13acc327964323c63d2db903e6cb44709902a09ff66d4e7837790645c73b21012cc104946'),
(52, 'shamimahmed82245@gmail.com', '8ead5ae918d85deb8e4c3e9159277c5aa4e47d745e948222c1d2e14a010d5025cfc1c0296916c0136c466a647dcd2ffba69f'),
(53, 'shamimahmed82245@gmail.com', 'afad3a4b9771bcacb470a9d1b5b1bada0af9a3466c576b6ab4a9aff755ef9d7af8a98355047d1578b2b9cb6176b6a03961e0');

-- --------------------------------------------------------

--
-- Table structure for table `review`
--

CREATE TABLE `review` (
  `r_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `rating` double NOT NULL,
  `review` text NOT NULL,
  `product` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `review`
--

INSERT INTO `review` (`r_id`, `name`, `rating`, `review`, `product`, `email`) VALUES
(17, 'shamim', 3, 'nice product', 's1.jpg', 'shamimahmed82245@gmail.com'),
(36, 'shamim', 4, 'good seed', 's2.jpg', 'shamimahmed82245@gmail.com'),
(37, 'shamim', 2.5, 'nice product', 'f1.jpg', 'shamimahmed82245@gmail.com'),
(38, 'shuvo', 3.5, 'good product', 'f1.jpg', 'abulbashershuvo@gmail.com');

-- --------------------------------------------------------

--
-- Table structure for table `seed`
--

CREATE TABLE `seed` (
  `p_id` int(11) NOT NULL,
  `p_image` varchar(255) NOT NULL,
  `p_name` varchar(255) NOT NULL,
  `p_weight` float NOT NULL,
  `p_price` float NOT NULL,
  `offer` float NOT NULL,
  `titleone` varchar(255) DEFAULT NULL,
  `desone` text DEFAULT NULL,
  `titletwo` varchar(255) DEFAULT NULL,
  `destwo` text DEFAULT NULL,
  `titlethree` varchar(255) DEFAULT NULL,
  `desthree` text DEFAULT NULL,
  `p_cat` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `seed`
--

INSERT INTO `seed` (`p_id`, `p_image`, `p_name`, `p_weight`, `p_price`, `offer`, `titleone`, `desone`, `titletwo`, `destwo`, `titlethree`, `desthree`, `p_cat`) VALUES
(1, 's1.jpg', 'করলা', 12, 100, 15, 'বৈশিষ্ট্য :', 'দিবস নিরপেক্ষ ও উচ্চ ফলনশীল হাইব্রিড জাত\r\nফল আকর্ষণীয় সবুজ রংয়ের\r\nফলের খাঁজ মৃদু ভোতা, ফল ৬-৭ ইঞ্চি লম্বা\r\nফল মাংসল ও টাইট\r\nগড় ওজন ২০০ - ২৫০ গ্রাম\r\nদূর পরিবহনে সুবিধাজনক', 'বীজ বপণের সময় :', 'শীত মৌসুম ছাড়া সারা বছর চাষ করা যায়, কিন্তু ফ্রেবুয়ারী-মার্চ এবং আগষ্ট-সেপ্টেম্বর মাসে চাষ করলে বেশি ফলন পাওয়া যায়', 'ফসল সংগ্রহের সময় :', 'চারা রোপনের ৪০-৪৫ দিন পর ফসল সংগ্রহ করা যায়', 2),
(2, 's2.jpg', 'নবাব', 10, 100, 5, 'বৈশিষ্ট্য :', 'আগাম হাইব্রিড জাত\r\nকার্টন সাইজ\r\nফল সুস্বাধু\r\nফল ১৪-১৫ ইঞ্চি লম্বা\r\nসাদা স্পট সহ ফল আকর্ষণীয় সবুজ রংয়ের\r\nগড় ওজন ২.০-২.৫ কেজি', 'বীজবপণেরসময় :', 'জুন -মার্চ শাক তোলার জন্য এবং জুলাই-নভেম্বর মাসে চাষ করলে বেশি ফলন পাওয়া যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৫০-৫৫ দিন পর ফসল সংগ্রহ করা যায়', 2),
(3, 's3.jpg', 'থাই গ্রীণ', 10, 60, 15, '\r\nবৈশিষ্ট্য :', 'ফল ৯-১০ ইঞ্চি লম্বা\r\nফল গাঢ় সবুজ রংয়ের\r\nগড় ওজন ২৮০-৩০০ গ্রাম\r\nআগাম চাষ উপযোগী হাইব্রিড জাত\r\nগিটে গিটে শসা ধরে', 'বীজবপণেরসময় :', 'ফ্রেবুয়ারী-মার্চ এবং আগষ্ট-সেপ্টেম্বর মাসে চাষ করলে বেশি ফলন পাওয়া যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৩৫-৪০ দিন পর ফসল সংগ্রহ করা যায়', 2),
(4, 's4.jpg', 'জালিরাজ', 10, 80, 5, 'বৈশিষ্ট্য :', 'আগাম ও উচ্চ ফলনশীল হাইব্রিড জাত\r\nফল হালকা সবুজ রঙের\r\nগড় ওজন ১.৪-১.৬ কেজি\r\nফল মাংশল, সুস্বাদু ও মোলায়েম\r\nএকর প্রতি ফলন ১৮-২০টন\r\n৫০ দিনে ফলন', 'বীজবপণেরসময় :', 'জুন -মার্চ শাক তোলার জন্য এবং জুলাই-নভেম্বর মাসে চাষ করলে বেশি ফলন পাওয়া যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৫০-৫৫ দিন পর ফসল সংগ্রহ করা যায়', 2),
(5, 's5.jpg', 'এভার গ্রীণ', 10, 60, 0, 'বৈশিষ্ট্য :', 'ফল ৭-৮ ইঞ্চি লম্বা\r\nফল গাঢ় সবুজ রংয়ের\r\nগড় ওজন ২৩০-২৫০ গ্রাম\r\nআগাম চাষ উপযোগী হাইব্রিড জাত\r\nগিটে গিটে শসা ধরে', 'বীজবপণেরসময় :', 'ফ্রেবুয়ারী-মার্চ এবং আগষ্ট-সেপ্টেম্বর মাসে চাষ করলে বেশি ফলন পাওয়া যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৩৫ দিন পর ফসল সংগ্রহ করা যায়', 2),
(6, 's6.jpg', 'নয়নতারা', 10, 60, 0, 'বৈশিষ্ট্য :', 'ফল ৬-৭ ইঞ্চি লম্বা\r\nফল গাঢ় সবুজ রংয়ের\r\nগড় ওজন ২০০ গ্রাম\r\nআগাম চাষ উপযোগী হাইব্রিড জাত\r\nগিটে গিটে শসা ধরে', 'বীজবপণেরসময় :', 'ফ্রেবুয়ারী-মার্চ এবং আগষ্ট-সেপ্টেম্বর মাসে চাষ করলে বেশি ফলন পাওয়া যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৩৫-৪০ দিন পর ফসল সংগ্রহ করা যায়', 2),
(7, 's7.jpg', 'গুডলাক', 50, 250, 0, 'বৈশিষ্ট্য :', 'ফল ৭-৮ ইঞ্চি লম্বা\r\nফল গাঢ় সবুজ রংয়ের\r\nগড় ওজন ১৮০-২০০ গ্রাম\r\nআগাম চাষ উপযোগী হাইব্রিড জাত\r\nগিটে গিটে শসা ধরে', 'বীজবপণেরসময় :', 'ফ্রেবুয়ারী-মার্চ এবং আগষ্ট-সেপ্টেম্বর মাসে চাষ করলে বেশি ফলন পাওয়া যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৩৫-৪০ দিন পর ফসল সংগ্রহ করা যায়', 2),
(8, 's8.jpg', 'নবাব', 30, 200, 0, 'বৈশিষ্ট্য :', 'আগাম হাইব্রিড জাত\r\nকার্টন সাইজ\r\nফল সুস্বাধু\r\nফল ১৪-১৫ ইঞ্চি লম্বা\r\nসাদা স্পট সহ ফল আকর্ষণীয় সবুজ রংয়ের\r\nগড় ওজন ২.০-২.৫ কেজি', 'বীজবপণেরসময় :', 'জুন -মার্চ শাক তোলার জন্য এবং জুলাই-নভেম্বর মাসে চাষ করলে বেশি ফলন পাওয়া যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৫০-৫৫ দিন পর ফসল সংগ্রহ করা যায়', 2),
(9, 's9.jpg', 'শাহেনশাহ্', 10, 100, 0, 'বৈশিষ্ট্য :', 'গম্বুজ/মিনার আকৃতি\r\nফল অধিক সুস্বাধু\r\nফল হালকা সবুজ রংয়ের\r\nগড় ওজন ২-২.৫ কেজি', 'বীজবপণেরসময় :', ' মে-জুন ছাড়া সারা বছর ফসল চাষ করা যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৫৫-৬০ দিন পর ফসল সংগ্রহ করা যায়', 2),
(10, 's10.jpg', 'সুলতান', 12, 100, 0, 'বৈশিষ্ট্য :', 'গম্বুজ/মিনার আকৃতি\r\nফল অধিক সুস্বাধু\r\nফল সবুজ রংয়ের\r\nগড় ওজন ২-২.৫ কেজি', 'বীজবপণেরসময় :', ' মে-জুন ছাড়া সারা বছর ফসল চাষ করা যায়', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৫৫-৬০ দিন পর ফসল সংগ্রহ করা যায়', 2),
(11, 's11.jpg', 'অনামিকা', 10, 100, 0, 'বৈশিষ্ট্য :', 'আগাম ও উচ্চ ফলনশীল জাত\r\nফল আকর্ষণীয় সবুজ রংয়ের\r\n৫ প্রকোষ্ট বিশিষ্ট শূল বা আলবিহীন, দীর্ঘদিন সতেজ থাকে\r\nবাজারজাতকরন সুবিধাজনক', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৪৫-৫০ দিন পর ফসল সংগ্রহ করা যায়', 'ফলন :', 'একর প্রতি ৮-১০ টন', 2),
(12, 's12.jpg', 'বারি-১ (ঢেড়শ)', 10, 100, 0, 'বৈশিষ্ট্য :', 'আগাম ও উচ্চ ফলনশীল জাত\r\nফল আকর্ষণীয় সবুজ রংয়ের\r\n৫ প্রকোষ্ট বিশিষ্ট শূল বা আলবিহীন, দীর্ঘদিন সতেজ থাকে\r\nবাজারজাতকরন সুবিধাজনক', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৪০-৪৫ দিন পর ফসল সংগ্রহ করা যায়', 'ফলন :', 'একর প্রতি ৭-১০ টন', 2),
(13, 's13.jpg', 'বারি-২ (ঢেড়শ)', 10, 100, 0, 'বৈশিষ্ট্য :', 'আগাম ও উচ্চ ফলনশীল জাত\r\nফল আকর্ষণীয় সবুজ রংয়ের\r\n৫ প্রকোষ্ট বিশিষ্ট শূল বা আলবিহীন, দীর্ঘদিন সতেজ থাকে\r\nবাজারজাতকরন সুবিধাজনক', '', 'চারা রোপনের ৪০-৪৫ দিন পর ফসল সংগ্রহ করা যায়', 'ফলন :', 'একর প্রতি ৭-১০ টন', 2),
(14, 's14.jpg', 'রতন', 30, 100, 0, 'বৈশিষ্ট্য :', 'উচ্চ ফলনশীল জাত\r\nগাছ লম্বাটে\r\nফল গোলাকার এবং আকর্ষণীয় লাল রঙের\r\nগড় ওজন ১০০-১১০ গ্রাম', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৮০-৯০ দিন পর ফসল সংগ্রহ করা যায়', 'ফলন :', 'একর প্রতি ২৫-৩০ টন', 2),
(15, 's15.jpg', 'চেরি গোল্ড', 30, 100, 0, 'বৈশিষ্ট্য :', 'উচ্চ ফলনশীল জাত\r\nগাছ লম্বাটে\r\nফল গোলাকার এবং আকর্ষণীয় লাল রঙের\r\nগড় ওজন ৯০-১০০ গ্রাম', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৮০-৯০ দিন পর ফসল সংগ্রহ করা যায়\r\n', 'ফলন :', 'একর প্রতি ২৫-৩০ টন', 2),
(16, 's16.jpg', 'বারোমাসি (হলুদ)', 12, 80, 0, 'বৈশিষ্ট্য :', 'উচ্চ ফলনশীল জাত\r\nফলের মাংশল অংশ বেশ পুরু এবং গাঢ় কমলা রংয়ের\r\nগড় ওজন ৪-৫ কেজি', 'বীজবপণেরসময় :', ' সারা বছর চাষের জন্য উপযোগী', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের  ৯০-৯৫ দিন পর ফসল সংগ্রহ করা যায়', 2),
(17, 's17.jpg', 'বারোমাসি (কলো)', 12, 80, 0, 'বৈশিষ্ট্য :', 'উচ্চ ফলনশীল জাত\r\nফলের মাংশল অংশ বেশ পুরু এবং গাঢ় কমলা রংয়ের\r\nগড় ওজন ৪-৫ কেজি', 'বীজবপণেরসময় :', ' সারা বছর চাষের জন্য উপযোগী', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের  ৯০-৯৫ দিন পর ফসল সংগ্রহ করা যায়', 2),
(18, 's18.jpg', 'দড়া পুই', 15, 60, 0, 'বৈশিষ্ট্য :', 'দ্রুত বর্ধনশীল উচ্চ ফলনশীল জাত\r\nপাতা পসারিত, ঘন\r\nফল আকর্ষণীয় সবুজ রংয়ের\r\nনরম এবং সুস্বাধু', 'ফসলসংগ্রহের সময় :', 'চারা রোপনের ৪০-৪৫ দিন পর ফসল সংগ্রহ করা যায়', 'ফলন :   ', 'একর প্রতি ২২-২৫ টন', 2),
(23, '768222442_Lucky7.jpg', 'লাকী ৭', 11, 250, 2, 'বৈশিষ্ট্য :', 'adgg', 'sff', '', '', '', 2);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `number` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`id`, `username`, `email`, `password`, `number`) VALUES
(1, 'admin', 'agroshop@gmail.com', '123', 175817581),
(2, 'Shamim ', 'shamimahmed82245@gmail.com', '1234', 1758175810),
(3, 'md.shuvo', 'abulbashershuvo@gmail.com', '123', 1813576042),
(4, 'SHUMON', 'sumon34@gmail.com', '1234', 0),
(6, 'shamimahmed82245', 'b190305006@cse.jnu.ac.bd', '234', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`cat_id`);

--
-- Indexes for table `disease`
--
ALTER TABLE `disease`
  ADD PRIMARY KEY (`p_id`);

--
-- Indexes for table `equipment`
--
ALTER TABLE `equipment`
  ADD PRIMARY KEY (`p_id`);

--
-- Indexes for table `fertilizer`
--
ALTER TABLE `fertilizer`
  ADD PRIMARY KEY (`p_id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`order_id`);

--
-- Indexes for table `password_reset`
--
ALTER TABLE `password_reset`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `review`
--
ALTER TABLE `review`
  ADD PRIMARY KEY (`r_id`);

--
-- Indexes for table `seed`
--
ALTER TABLE `seed`
  ADD PRIMARY KEY (`p_id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `category`
--
ALTER TABLE `category`
  MODIFY `cat_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `disease`
--
ALTER TABLE `disease`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `equipment`
--
ALTER TABLE `equipment`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `fertilizer`
--
ALTER TABLE `fertilizer`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `order_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT for table `password_reset`
--
ALTER TABLE `password_reset`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT for table `review`
--
ALTER TABLE `review`
  MODIFY `r_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT for table `seed`
--
ALTER TABLE `seed`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
